source/_static/diagrams/42-a-performance-function-is-a-number-with-a-unit-2.d2
direction: right
n0: "extract"
n1: "number"
n2: "unit"
n3: "reference"
n0 -> n1
n1 -> n2
n2 -> n3
